1. 데이터셋  영화 타이틀 데이터 셋. 
      -. moves_title.csv 
  2. titles의 Data Frame을 만든다. 
  3. df 필수 명령 8가지 실행 

  4. 전체 영화는 몇개인가? 
  5. 가장 빠른 시기에 제작된 영화 2개를 찾아라. 
  6. 제목이 "Hamlet"인 영화는 몇개인가? 
  7. 제목이 "Treasure Island"는 몇개인가? 제작년도 오름차순으로 나열
  8. 1950년에서 1959년사이에 만들어진 영화는 몇개인가? 

  다 끝나신분.. numpy quickstart 학습.. 
  https://numpy.org/doc/stable/user/quickstart.html

In [1]:
import numpy as np
import pandas as pd

In [2]:
titles = pd.read_csv("C:/soyun_coding/week2_python/movies_title.csv")

In [3]:
# 3-1. 첫 5행
titles.head()

                     title  year
0           The Rising Son  1990
1        Ashes of Kukulcan  2016
2  The Thousand Plane Raid  1969
3         Crucea de piatra  1993
4                   The 86  2015

In [4]:
# 3-2
titles.tail()

                      title  year
215976       Le mouton noir  1922
215977  Edge of the Unknown  2015
215978                E yue  2005
215979         Lakota Girls  2015
215980         The Sting II  1983

In [5]:
# 3-3
titles.columns

Index(['title', 'year'], dtype='object')

In [6]:
# 3-4
titles.shape

(215981, 2)

In [7]:
# 3-5
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215981 entries, 0 to 215980
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   215981 non-null  object
 1   year    215981 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.3+ MB

In [8]:
# 3-6
list(titles.columns)

['title', 'year']

In [9]:
# 3-7
titles.isnull()

        title   year
0       False  False
1       False  False
2       False  False
3       False  False
4       False  False
...       ...    ...
215976  False  False
215977  False  False
215978  False  False
215979  False  False
215980  False  False

[215981 rows x 2 columns]

In [10]:
titles.isnull().sum()

title    0
year     0
dtype: int64

In [11]:
# 3-8
titles.describe()

                year
count  215981.000000
mean     1984.553822
std        29.343957
min      1894.000000
25%      1965.000000
50%      1994.000000
75%      2010.000000
max      2024.000000

In [12]:
titles['year']

0         1990
1         2016
2         1969
3         1993
4         2015
          ...
215976    1922
215977    2015
215978    2005
215979    2015
215980    1983
Name: year, Length: 215981, dtype: int64

In [13]:
titles['year'].value_counts().sort_index()

1894     1
1897     1
1899     2
1900     4
1903     1
        ..
2019    46
2020    36
2021     8
2022     3
2024     2
Name: year, Length: 124, dtype: int64

In [14]:
titles['year'].value_counts().sort_values(ascending=False)

2015    13978
2014     8209
2013     7664
2012     7273
2011     6844
        ...
1899        2
2024        2
1903        1
1897        1
1894        1
Name: year, Length: 124, dtype: int64

# 4. 전체 영화는 몇개?

In [15]:
titles['title'].value_counts().sum()

215981

In [16]:
# 5. 가장 빠른 시기 제작된 영화 2개

In [17]:
titles['year'].value_counts().sort_index()

1894     1
1897     1
1899     2
1900     4
1903     1
        ..
2019    46
2020    36
2021     8
2022     3
2024     2
Name: year, Length: 124, dtype: int64

In [40]:
titles.loc[(titles['year'] == 1894)]

             title  year
165182  Miss Jerry  1894

In [41]:
titles.loc[(titles['year'] == 1897)]

                                                   title  year
85708  Reproduction of the Corbett and Fitzsimmons Fight  1897

In [48]:
A = titles.loc[(titles['year'] == 1894)]
B = titles.loc[(titles['year'] == 1897)]
print(A["title"])
print(B ["title"])

165182    Miss Jerry
Name: title, dtype: object
85708    Reproduction of the Corbett and Fitzsimmons Fight
Name: title, dtype: object

In [20]:
# 6. 제목이 Hamlet

In [21]:
titles.loc[(titles['title'] == "Hamlet")]

         title  year
5562    Hamlet  1948
26160   Hamlet  2016
37373   Hamlet  2015
42224   Hamlet  1990
43511   Hamlet  1910
68239   Hamlet  1954
85741   Hamlet  1976
87781   Hamlet  1987
87971   Hamlet  2000
91710   Hamlet  1921
114224  Hamlet  1969
154627  Hamlet  1913
163645  Hamlet  2009
169996  Hamlet  1964
186988  Hamlet  1996
192815  Hamlet  2011
195015  Hamlet  1911
205821  Hamlet  1973
207793  Hamlet  2014

In [29]:
A = titles.loc[(titles['title'] == "Hamlet")].value_counts().sum()
print("제목이 Hamlet인 영화는 {}개".format(A))

제목이 Hamlet인 영화는 19개

In [23]:
#  7. 제목이 "Treasure Island"는 몇개인가? 제작년도 오름차순으로 나열

In [30]:
B = titles.loc[(titles['title'] == "Treasure Island")].value_counts().sum()
print("제목이 Treasure Island인 영화는 {}개".format(B))

제목이 Treasure Island인 영화는 8개

In [25]:
titles.loc[(titles['title'] == "Treasure Island")].value_counts().sort_index()

title            year
Treasure Island  1918    1
                 1920    1
                 1934    1
                 1950    1
                 1972    1
                 1973    1
                 1985    1
                 1999    1
dtype: int64

In [26]:
# 8. 1950년에서 1959년사이에 만들어진 영화는 몇개인가?

In [50]:
A = []
for i in titles['year']:
    if i >= 1950 and i<=1959:
        A.append(i)
print("1950년에서 1959년 사이 만들어진 영화는 {}개".format(len(A)))

1950년에서 1959년 사이 만들어진 영화는 12120개